Bwooce/tinygs_nRF52/src/main.cpp
    otIp6Address addr;
    uint32_t ttl;
    otError err = otDnsAddressResponseGetAddress(aResponse, 0, &addr, &ttl);
    if (err != OT_ERROR_NONE) {
        LOG_ERR("OT DNS no address in response: %d", (int)err);
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    /* Store resolved address into broker_addr */
    struct sockaddr_in6 *sin6 = (struct sockaddr_in6 *)&broker_addr;
    memset(sin6, 0, sizeof(*sin6));
    sin6->sin6_family = AF_INET6;
    sin6->sin6_port = htons(MQTT_BROKER_PORT);
    memcpy(&sin6->sin6_addr, &addr, sizeof(addr));

    char addr_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&addr, addr_str, sizeof(addr_str));
    LOG_INF("Resolved %s -> [%s]:%d (TTL=%u)",
            MQTT_BROKER_HOSTNAME, addr_str, MQTT_BROKER_PORT, (unsigned)ttl);

    dns_result = 0;
    k_sem_give(&dns_sem);
}

static int resolve_broker(void)
{
    struct openthread_context *ctx = openthread_get_default_context();

    LOG_INF("Resolving %s via OT DNS...", MQTT_BROKER_HOSTNAME);

    k_sem_reset(&dns_sem);
    dns_result = -1;

    /*
     * Resolve via nat64.net's public DNS64 resolver.
     * Returns globally-routable AAAA addresses (e.g. 2a00:1098:2c::5:9fc3:4a17).
     * No local NAT64 translator needed — nat64.net's infrastructure translates.
     */
    openthread_api_mutex_lock(ctx);

    /* Configure OT DNS to use nat64.net's DNS64 resolver */
    otDnsQueryConfig config;
    memset(&config, 0, sizeof(config));

    /* nat64.net DNS64: 2a00:1098:2c::1 port 53 */
    otIp6Address dnsServer;
    memset(&dnsServer, 0, sizeof(dnsServer));
    dnsServer.mFields.m16[0] = htons(0x2a00);
    dnsServer.mFields.m16[1] = htons(0x1098);
    dnsServer.mFields.m16[2] = htons(0x002c);
    /* m16[3..6] = 0 */
    dnsServer.mFields.m16[7] = htons(0x0001);

    config.mServerSockAddr.mAddress = dnsServer;
    config.mServerSockAddr.mPort = 53;
    config.mResponseTimeout = 10000; /* 10s — nat64.net is ~250ms away */
    config.mMaxTxAttempts = 3;
    config.mRecursionFlag = OT_DNS_FLAG_RECURSION_DESIRED;
    config.mNat64Mode = OT_DNS_NAT64_ALLOW;

    char dns_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&dnsServer, dns_str, sizeof(dns_str));
    LOG_INF("Resolving %s via nat64.net DNS64 [%s]:53 ...",
            MQTT_BROKER_HOSTNAME, dns_str);

    /* Query for AAAA — nat64.net DNS64 returns synthesized routable addresses */
    otError err = otDnsClientResolveAddress(ctx->instance,
                                            MQTT_BROKER_HOSTNAME,
                                            dns_callback, NULL,
                                            &config);
    openthread_api_mutex_unlock(ctx);

    if (err != OT_ERROR_NONE) {
        LOG_ERR("otDnsClientResolveAddress failed: %d", (int)err);
        return -1;
    }

    /* Wait for callback (up to 15s) */
    if (k_sem_take(&dns_sem, K_SECONDS(15)) != 0) {
        LOG_ERR("DNS resolution timed out");
        return -1;
    }

    return dns_result;
}

/* -------------------------------------------------------------------------- */
/* MQTT Event Handler                                                          */
/* -------------------------------------------------------------------------- */

static uint32_t mqtt_connected_uptime_ms = 0;
static uint32_t mqtt_last_pingresp_ms = 0;

/* Device MAC-based client ID — ESP32 format %04X%08X */
char device_client_id[13] = {0};

/* Forward declaration — defined later in RadioLib section */
extern SX1262 *radio;

static void mqtt_evt_handler(struct mqtt_client *client, const struct mqtt_evt *evt)
{
    uint32_t now = k_uptime_get_32();

    switch (evt->type) {
    case MQTT_EVT_CONNACK:
        if (evt->result == 0) {
            mqtt_connected_uptime_ms = now;
            LOG_INF("MQTT CONNECTED to %s:%d", MQTT_BROKER_HOSTNAME, MQTT_BROKER_PORT);

            {
                /* Station name for topics = cfg_station (dashboard-configured).
                 * MAC (device_client_id) is only for MQTT connect and the mac JSON field. */
                extern char device_client_id[13];

                tinygs_subscribe(client, cfg_mqtt_user, cfg_station);
                tinygs_send_welcome(client, cfg_mqtt_user, cfg_station,
                                    device_client_id);

                /* Web login URL can be requested manually if needed.
                 * Publishes to tele/get_weblogin, server responds on cmnd/weblogin
                 * with a one-time URL for configuring auto-tune etc on tinygs.com.
                 * TODO: trigger via button press or config.json flag */
            }

            app_state = STATE_MQTT_CONNECTED;
        } else {
            LOG_ERR("MQTT CONNACK error: %d", evt->result);
            app_state = STATE_ERROR;
        }
        break;

    case MQTT_EVT_DISCONNECT:
        LOG_WRN("MQTT DISCONNECTED after %us: result=%d",
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000,
                evt->result);
        app_state = STATE_ERROR;
        break;

    case MQTT_EVT_PINGRESP:
        mqtt_last_pingresp_ms = now;
        LOG_INF("MQTT PINGRESP (connected %us)",
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;

    case MQTT_EVT_PUBLISH: {
        const struct mqtt_publish_param *pub = &evt->param.publish;
        static char rx_topic[128];
        static uint8_t rx_payload[768];
        uint32_t topic_len = MIN(pub->message.topic.topic.size, sizeof(rx_topic) - 1);
        memcpy(rx_topic, pub->message.topic.topic.utf8, topic_len);
        rx_topic[topic_len] = '\0';

        uint32_t payload_len = MIN(pub->message.payload.len, sizeof(rx_payload) - 1);
        int ret = mqtt_read_publish_payload(client, rx_payload, payload_len);
        if (ret < 0) {
            LOG_ERR("MQTT payload read error: %d", ret);
            break;
        }
        rx_payload[ret] = '\0';

        LOG_INF("MQTT RX [%s] (%d bytes)", rx_topic, ret);
        if (ret < 200) {
            LOG_INF("  payload: %s", (char *)rx_payload);
        }

        /* Extract command name from topic:
         * tinygs/global/cmnd/XXX or tinygs/user/station/cmnd/XXX */
        const char *cmnd = strstr(rx_topic, "/cmnd/");
        if (cmnd) {
            cmnd += 6;  /* skip "/cmnd/" */
            LOG_INF("  command: %s", cmnd);

            if (strcmp(cmnd, "begine") == 0 ||
                strcmp(cmnd, "batch_conf") == 0) {
                /* Reconfigure radio from JSON payload.
                 * Minimal parser — extract freq, sf, bw, cr, sat */
                LOG_INF("  → Applying radio config...");
                if (radio != nullptr) {
                    const char *p;
                    /* Parse and apply frequency */
                    p = strstr((char *)rx_payload, "\"freq\":");
                    if (p) {
                        float freq = strtof(p + 7, NULL);
                        if (freq > 100.0f && freq < 1000.0f) {
                            int st = radio->setFrequency(freq);
                            tinygs_radio.frequency = freq;
                            LOG_INF("  freq=%.4f MHz (%s)", (double)freq,
                                    st == RADIOLIB_ERR_NONE ? "OK" : "FAIL");
                        }
                    }
                    /* Parse and apply SF */
                    p = strstr((char *)rx_payload, "\"sf\":");
                    if (p) {
                        int sf = atoi(p + 5);
                        if (sf >= 5 && sf <= 12) {
                            radio->setSpreadingFactor(sf);
                            tinygs_radio.sf = sf;
                            LOG_INF("  sf=%d", sf);
                        }
                    }
                    /* Parse and apply BW */
                    p = strstr((char *)rx_payload, "\"bw\":");
                    if (p) {
                        float bw = strtof(p + 5, NULL);
                        radio->setBandwidth(bw);
                        tinygs_radio.bw = bw;
                        LOG_INF("  bw=%.1f kHz", (double)bw);
                    }
                    /* Parse and apply CR */
                    p = strstr((char *)rx_payload, "\"cr\":");
                    if (p) {
                        int cr = atoi(p + 5);
                        radio->setCodingRate(cr);
                        tinygs_radio.cr = cr;
                        LOG_INF("  cr=%d", cr);
                    }
                    /* Parse and apply sync word */
                    p = strstr((char *)rx_payload, "\"sw\":");
                    if (p) {
                        int sw = atoi(p + 5);
                        radio->setSyncWord(sw);
                        LOG_INF("  sw=%d", sw);
                    }
                    /* Parse and apply preamble length */
                    p = strstr((char *)rx_payload, "\"pl\":");
                    if (p) {
                        int pl = atoi(p + 5);
                        radio->setPreambleLength(pl);
                        LOG_INF("  pl=%d", pl);
                    }
                    /* Parse and apply inverted IQ */
                    p = strstr((char *)rx_payload, "\"iIQ\":");
                    if (p) {
                        bool iiq = (strncmp(p + 6, "true", 4) == 0);
                        if (iiq) {
                            radio->invertIQ(true);
                        } else {
                            radio->invertIQ(false);
                        }
                        LOG_INF("  iIQ=%s", iiq ? "true" : "false");
                    }
                    /* Parse and apply CRC */
                    p = strstr((char *)rx_payload, "\"crc\":");
                    if (p) {
                        bool crc = (strncmp(p + 6, "true", 4) == 0);
                        radio->setCRC(crc ? 2 : 0);
                        LOG_INF("  crc=%s", crc ? "on" : "off");
                    }
                    /* Parse satellite name */
                    p = strstr((char *)rx_payload, "\"sat\":\"");
                    if (p) {
                        const char *end = strchr(p + 7, '"');
                        if (end && (end - p - 7) < (int)sizeof(tinygs_radio.satellite)) {
                            memcpy(tinygs_radio.satellite, p + 7, end - p - 7);
                            tinygs_radio.satellite[end - p - 7] = '\0';
                            LOG_INF("  satellite: %s", tinygs_radio.satellite);
                        }
                    }
                    /* Parse NORAD */
                    p = strstr((char *)rx_payload, "\"NORAD\":");
                    if (p) {
                        tinygs_radio.norad = (uint32_t)atoi(p + 8);
                        LOG_INF("  NORAD: %u", (unsigned)tinygs_radio.norad);
                    }
                    /* Don't store raw begine JSON as modem_conf — it contains
                     * unescaped quotes that break our snprintf JSON serialization.
                     * modem_conf stays as "{}" until we have proper JSON escaping.
                     * TODO: escape quotes or use a JSON library for welcome payload.
                     *
                     * Don't save radio state to NVS — satellites change every
                     * minute, which would blow out flash wear-leveling. The server
                     * sends a fresh begine within 60s of every MQTT connect. */
                    /* Restart reception */
                    radio->startReceive();
                    LOG_INF("  Radio reconfigured, listening");
                }
            } else if (strcmp(cmnd, "freq") == 0) {
                /* Direct frequency set (MHz as number) */
                float freq = strtof((char *)rx_payload, NULL);
                if (radio && freq > 100.0f && freq < 1000.0f) {
                    radio->setFrequency(freq);
                    tinygs_radio.frequency = freq;
                    radio->startReceive();
                    LOG_INF("  → freq=%.4f MHz", (double)freq);
                }
            } else if (strcmp(cmnd, "sat") == 0) {
                /* Select satellite — payload is JSON string with sat name */
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) < (int)sizeof(tinygs_radio.satellite)) {
                        memcpy(tinygs_radio.satellite, p + 1, end - p - 1);
                        tinygs_radio.satellite[end - p - 1] = '\0';
                        LOG_INF("  → satellite: %s", tinygs_radio.satellite);
                    }
                }
            } else if (strcmp(cmnd, "set_pos_prm") == 0) {
                tinygs_handle_set_pos((char *)rx_payload, ret);
            } else if (strcmp(cmnd, "set_name") == 0) {
                /* Rename station: ["MAC", "new_name"]
                 * Only apply if MAC matches our device. Needs NVS to persist. */
                extern char device_client_id[13];
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) == 12) {
                        char mac[13];
                        memcpy(mac, p + 1, 12);
                        mac[12] = '\0';
                        if (strcmp(mac, device_client_id) == 0) {
                            /* Find second string (new name) */
                            p = strchr(end + 1, '"');
                            if (p) {
                                end = strchr(p + 1, '"');
                                if (end) {
                                    char name[32];
                                    size_t nlen = end - p - 1;
                                    if (nlen < sizeof(name)) {
                                        memcpy(name, p + 1, nlen);
                                        name[nlen] = '\0';
                                        LOG_INF("  → Rename requested: %s (needs NVS persist)", name);
                                        /* TODO: persist to NVS, reconnect with new name */
                                    }
                                }
                            }
                        } else {
                            LOG_DBG("  → set_name: MAC mismatch (%s != %s)", mac, device_client_id);
                        }
                    }
                }
            } else if (strcmp(cmnd, "status") == 0) {
                tinygs_send_status(client, cfg_mqtt_user, cfg_station);
            } else if (strcmp(cmnd, "reset") == 0) {
                LOG_WRN("  → Reset requested by server");
                k_msleep(500);
                sys_reboot(SYS_REBOOT_COLD);
            } else if (strcmp(cmnd, "tx") == 0) {
                LOG_INF("  → TX not supported (tx=false)");
            } else if (strcmp(cmnd, "log") == 0) {
                LOG_INF("  → Server: %s", (char *)rx_payload);
            } else if (strcmp(cmnd, "sleep") == 0 || strcmp(cmnd, "siesta") == 0) {
                LOG_INF("  → Sleep requested (not implemented yet)");
            } else if (strcmp(cmnd, "foff") == 0) {
                /* Frequency offset in Hz */
                LOG_INF("  → Freq offset: %s Hz (TODO: apply)", (char *)rx_payload);
            } else if (strcmp(cmnd, "filter") == 0) {
                LOG_INF("  → Packet filter: %s (TODO: apply)", (char *)rx_payload);
            } else if (strcmp(cmnd, "update") == 0) {
                LOG_INF("  → OTA update not supported (UF2 bootloader)");
            } else if (strcmp(cmnd, "weblogin") == 0) {
                LOG_INF("  *** TinyGS Web Login URL: %s", (char *)rx_payload);
                LOG_INF("  *** Open this URL to configure auto-tune and other settings");
            } else {
                LOG_INF("  → Unhandled command: %s", cmnd);
            }
        }

        if (pub->message.topic.qos == MQTT_QOS_1_AT_LEAST_ONCE) {
            struct mqtt_puback_param ack = { .message_id = pub->message_id };
            mqtt_publish_qos1_ack(client, &ack);
        }
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d (connected %us)",
                evt->type,
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;
    }
}

