Bwooce/tinygs_nRF52/src/main.cpp
    LOG_INF("Mounting FATFS...");

    /* Check FAT boot sector signature BEFORE mounting. FatFs will crash
     * (HardFault) on corrupted FAT data because it follows garbage pointers.
     * Reading raw flash is safe — no FatFs code involved. If invalid,
     * format through the disk driver (which manages the write cache). */
    {
        const struct device *flash_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_flash_controller));
        uint8_t sig[2];
        flash_read(flash_dev, 0xE2000 + 510, sig, 2);
        if (sig[0] == 0xFF && sig[1] == 0xFF) {
            /* Erased flash — fs_mount with MOUNT_MKFS will auto-format */
            LOG_INF("FATFS: partition erased, will auto-format on mount");
        } else if (sig[0] != 0x55 || sig[1] != 0xAA) {
            /* Corrupted data — erase partition and reboot to avoid FatFs crash */
            LOG_WRN("FATFS: corrupt boot sector (0x%02X 0x%02X), erasing",
                    sig[0], sig[1]);
            flash_erase(flash_dev, 0xE2000, 0x6000);
            LOG_INF("Partition erased, rebooting...");
            k_msleep(100);
            sys_reboot(SYS_REBOOT_COLD);
        }
    }

    int res = fs_mount(&mp);
    LOG_INF("FATFS mount: %d", res);

    if (res == 0) {
        /* Write index.html if it doesn't exist */
        if (fs_stat("/NAND:/index.html", &entry) != 0) {
            fs_file_t_init(&file);
            if (fs_open(&file, "/NAND:/index.html", FS_O_CREATE | FS_O_WRITE) == 0) {
                fs_write(&file, html_content, strlen(html_content));
                fs_sync(&file);
                fs_close(&file);
            }
        }

        /* Read config.json if it exists — station location, name, etc.
         * This is the only time we can read FATFS (before USB MSC takes over). */
        {
            static char cfg_buf[512];
            struct fs_file_t cfg;
            fs_file_t_init(&cfg);
            if (fs_open(&cfg, "/NAND:/config.json", FS_O_READ) == 0) {
                ssize_t n = fs_read(&cfg, cfg_buf, sizeof(cfg_buf) - 1);
                fs_close(&cfg);
                if (n > 0) {
                    cfg_buf[n] = '\0';
                    LOG_INF("Loaded config.json (%d bytes)", (int)n);

                    /* Parse latitude */
                    const char *p = strstr(cfg_buf, "\"lat\":");
                    if (p) {
                        float lat = strtof(p + 6, NULL);
                        if (lat >= -90.0f && lat <= 90.0f) {
                            tinygs_station_lat = lat;
                        }
                    }
                    /* Parse longitude */
                    p = strstr(cfg_buf, "\"lon\":");
                    if (p) {
                        float lon = strtof(p + 6, NULL);
                        if (lon >= -180.0f && lon <= 180.0f) {
                            tinygs_station_lon = lon;
                        }
                    }
                    /* Parse altitude */
                    p = strstr(cfg_buf, "\"alt\":");
                    if (p) {
                        tinygs_station_alt = strtof(p + 6, NULL);
                    }

                    /* Parse station name */
                    p = strstr(cfg_buf, "\"station\":\"");
                    if (p) {
                        const char *end = strchr(p + 11, '"');
                        if (end && (end - p - 11) < (int)sizeof(cfg_station)) {
                            memcpy(cfg_station, p + 11, end - p - 11);
                            cfg_station[end - p - 11] = '\0';
                        }
                    }
                    /* Parse MQTT username */
                    p = strstr(cfg_buf, "\"mqtt_user\":\"");
                    if (p) {
                        const char *end = strchr(p + 13, '"');
                        if (end && (end - p - 13) < (int)sizeof(cfg_mqtt_user)) {
                            memcpy(cfg_mqtt_user, p + 13, end - p - 13);
                            cfg_mqtt_user[end - p - 13] = '\0';
                        }
                    }
                    /* Parse MQTT password */
                    p = strstr(cfg_buf, "\"mqtt_pass\":\"");
                    if (p) {
                        const char *end = strchr(p + 13, '"');
                        if (end && (end - p - 13) < (int)sizeof(cfg_mqtt_pass)) {
                            memcpy(cfg_mqtt_pass, p + 13, end - p - 13);
                            cfg_mqtt_pass[end - p - 13] = '\0';
                        }
                    }

                    LOG_INF("Config: station=%s user=%s lat=%.4f lon=%.4f alt=%.0f",
                            cfg_station, cfg_mqtt_user,
                            (double)tinygs_station_lat,
                            (double)tinygs_station_lon,
                            (double)tinygs_station_alt);
                }
            } else {
                LOG_INF("No config.json found — using defaults");
            }
        }

        /*
         * Unmount FATFS before enabling USB MSC.
         * Once USB is active, the host OS owns the FAT sectors.
         * Any firmware writes to FATFS while mounted via USB will corrupt it.
         * Runtime config changes should use NVS and sync to FATFS on reboot.
         */
        /* Force flush flashdisk cache to flash before USB MSC takes over */
        disk_access_ioctl("NAND", DISK_IOCTL_CTRL_SYNC, NULL);
        fs_unmount(&mp);
    }

    /* USB is already enabled in main() before this function is called */
}

/* -------------------------------------------------------------------------- */
/* RadioLib (SX1262)                                                           */
/* -------------------------------------------------------------------------- */

static ZephyrHal radio_hal(lora_spi.bus, (struct spi_config *)&lora_spi.config);
static Module *radio_mod = nullptr;
SX1262 *radio = nullptr;  /* non-static — accessed from MQTT callback */

/* LoRa packet reception flag — set by DIO1 ISR */
static volatile bool lora_packet_received = false;

static void lora_rx_callback(void)
{
    lora_packet_received = true;
}

static void init_radio(void)
{
    LOG_INF("Initializing SX1262...");

