Bwooce/tinygs_nRF52/src/main.cpp
    uint32_t cs   = radio_hal.addPin(&lora_cs);
    uint32_t rst  = radio_hal.addPin(&lora_reset);
    uint32_t busy = radio_hal.addPin(&lora_busy);
    uint32_t dio1 = radio_hal.addPin(&lora_dio1);

    /* Run HAL smoke tests before radio init */
    extern int zephyr_hal_run_tests(ZephyrHal *hal);
    zephyr_hal_run_tests(&radio_hal);

    radio_mod = new Module(&radio_hal, cs, dio1, rst, busy);
    radio = new SX1262(radio_mod);

    int state = radio->begin();
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("SX1262 OK");
    } else {
        LOG_ERR("SX1262 init failed: %d", state);
        return;
    }

    /* Set default LoRa config — 433MHz, SF10, BW125, CR5
     * This will be overridden by server batch_conf commands */
    state = radio->setFrequency(436.703);
    if (state != RADIOLIB_ERR_NONE) {
        LOG_ERR("setFrequency failed: %d", state);
    }
    radio->setSpreadingFactor(10);
    radio->setBandwidth(250.0);
    radio->setCodingRate(5);
    radio->setSyncWord(0x12);

    /* Register DIO1 interrupt callback and start receiving */
    radio->setPacketReceivedAction(lora_rx_callback);
    state = radio->startReceive();
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("SX1262 listening on 436.703 MHz, SF10, BW250");
    } else {
        LOG_ERR("startReceive failed: %d", state);
    }
}

/*
 * Check for received LoRa packets and process them.
 * Called from the main loop. Returns true if a packet was processed.
 */
static bool lora_check_rx(void)
{
    if (!lora_packet_received || radio == nullptr) {
        return false;
    }

    lora_packet_received = false;

    size_t len = radio->getPacketLength();
    if (len == 0 || len > 255) {
        radio->startReceive();
        return false;
    }

    uint8_t data[256];
    int state = radio->readData(data, len);

    float rssi = radio->getRSSI();
    float snr = radio->getSNR();
    float freq_err = radio->getFrequencyError();

    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("LoRa RX: %u bytes, RSSI=%.1f, SNR=%.1f, FreqErr=%.1f",
                (unsigned)len, (double)rssi, (double)snr, (double)freq_err);
        LOG_HEXDUMP_INF(data, MIN(len, 32), "Packet data:");

        /* Publish via MQTT if connected */
        if (app_state == STATE_MQTT_CONNECTED) {
            tinygs_send_rx(&mqtt_client, cfg_mqtt_user, cfg_station,
                           data, len, rssi, snr, freq_err);
        }
    } else if (state == RADIOLIB_ERR_CRC_MISMATCH) {
        LOG_WRN("LoRa RX: CRC error, %u bytes", (unsigned)len);
    } else {
        LOG_ERR("LoRa readData failed: %d", state);
    }

    /* Restart reception */
    radio->startReceive();
    return true;
}

/* -------------------------------------------------------------------------- */
/* Main                                                                        */
/* -------------------------------------------------------------------------- */

int main(void)
{
    const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
    uint32_t dtr = 0;

    if (device_is_ready(console_dev)) {
        cdc_acm_dte_rate_callback_set(console_dev, baudrate_reset_handler);
    }

    enable_peripherals();

    /* FATFS operations BEFORE USB enable — mount, write, read, unmount.
     * Must complete before USB MSC goes live to avoid concurrent access. */
    setup_usb_storage();

    /* Enable USB composite (CDC ACM console + MSC drive) */
    if (usb_enable(NULL) == 0) {
        LOG_INF("USB active (MSC + CDC ACM)");
    }

    /* Wait briefly for serial monitor to connect */
    for (int i = 0; i < 30 && !dtr; i++) {
        uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr);
        k_msleep(100);
    }

    LOG_INF("=== TinyGS nRF52 Phase 2: MQTT-TLS over Thread ===");
    log_heap_usage("boot");
    init_openthread();

    /* Load persistent config from NVS. Must be AFTER init_openthread()
     * because OpenThread initializes the settings/NVS subsystem.
     * No extra CONFIG_SETTINGS needed in prj.conf — OpenThread provides it.
     * config.json values are loaded first (in setup_usb_storage), then
     * NVS overrides with any previously saved values. */
    tinygs_config_init();

    init_radio();

    int retry_count = 0;
    int mqtt_poll_fd_count = 0;
    struct zsock_pollfd mqtt_poll_fd;

    while (1) {
        switch (app_state) {

        case STATE_WAIT_THREAD:
            if (thread_attached) {
                log_heap_usage("thread_attached");
                LOG_INF("--- Thread attached, waiting 5s for routing to stabilize ---");
                k_msleep(5000);
                app_state = STATE_DNS_RESOLVE;
                retry_count = 0;
            } else {
                LOG_INF("Waiting for Thread network... (%ds)", retry_count * 10);
                log_ot_diagnostics();
                retry_count++;
                k_msleep(10000);
            }
            break;

        case STATE_DNS_RESOLVE:
            log_heap_usage("pre_dns");
            log_ot_diagnostics();
            if (resolve_broker() == 0) {
                app_state = STATE_MQTT_CONNECT;
            } else {
                retry_count++;
                if (retry_count > 10) {
                    LOG_ERR("DNS failed after %d attempts", retry_count);
                    app_state = STATE_ERROR;
                } else {
                    LOG_WRN("DNS retry %d/10 in 5s...", retry_count);
                    k_msleep(5000);
                }
            }
            break;

        case STATE_MQTT_CONNECT:
            log_heap_usage("pre_tls");
            if (mqtt_tls_connect() == 0) {
                /* Set up poll fd for mqtt_input */
                mqtt_poll_fd.fd = mqtt_client.transport.tls.sock;
                mqtt_poll_fd.events = ZSOCK_POLLIN;
                mqtt_poll_fd_count = 1;

                /* Process until CONNACK or timeout */
                int wait_ms = 15000; /* 15s for TLS handshake + CONNACK */
                while (app_state == STATE_MQTT_CONNECT && wait_ms > 0) {
                    int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 1000);
                    if (rc > 0) {
                        mqtt_input(&mqtt_client);
                    }
                    mqtt_live(&mqtt_client);
                    wait_ms -= 1000;
                }
                if (app_state == STATE_MQTT_CONNECT) {
                    LOG_ERR("MQTT connect timeout (no CONNACK in 15s)");
                    mqtt_disconnect(&mqtt_client);
                    app_state = STATE_ERROR;
                }
            } else {
                app_state = STATE_ERROR;
            }
            break;

        case STATE_MQTT_CONNECTED: {
            log_heap_usage("mqtt_connected");
            LOG_INF("=== MQTT-TLS CONNECTION SUCCESSFUL ===");

            /* TinyGS main loop — process MQTT, LoRa RX, and pings */
            uint32_t last_ping_ms = k_uptime_get_32();

            while (app_state == STATE_MQTT_CONNECTED) {
                /* Poll MQTT socket for incoming data */
                int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 100);
                if (rc > 0) {
                    mqtt_input(&mqtt_client);
                }
                mqtt_live(&mqtt_client);

                /* Check for LoRa packet reception */
                lora_check_rx();

                /* Send TinyGS ping every 60s */
                uint32_t now_ms = k_uptime_get_32();
                if ((now_ms - last_ping_ms) >= (TINYGS_PING_INTERVAL_S * 1000)) {
                    tinygs_send_ping(&mqtt_client, cfg_mqtt_user, cfg_station);
                    last_ping_ms = now_ms;
                }

                k_msleep(100);  /* 100ms loop — responsive to LoRa packets */
            }
            break;
        }

        case STATE_ERROR:
            LOG_ERR("Error state. Retrying in 30s...");
            k_msleep(30000);
            app_state = thread_attached ? STATE_DNS_RESOLVE : STATE_WAIT_THREAD;
            retry_count = 0;
            break;
        }
    }

    return 0;
}
